; TCIMG_English.lng
; https://t.me/tcimg
; English translation - LonerD + TCIMG 30.0  Averin Andrey GoogleTranslate 19.12.2021
; Site http://DreamLair.net
[English]
Translite=File Information fields|About|Universal comand line utility for different system operations|for|plugin|Input string|Enter the information required|string|Enter a new name|Element|in directory|exists|enter a new name|Process|Task completed|Program to open files|Program to open files not found|Enter the path to the program to open files. Program will be written to key TextEdit section [Programs] TCIMG.ini| Version|Copy|Website|Details in Help|View Help|Donate|Choose directory|Create file|File with extension|in the templates directory was not found. You can create it now or create it yourself. To create now press|Install font|Update|Fonts|Can not open library|Warning|The following icons are not added|invalid format|Number|Title|Data|Copy selected|Active|L|R|selected|KB|all|files|directories|Way.|Left|Right|filter|panel|if there|Panel information|process information|windows information|Create Help|Check TCIMGHELP directory...|Directory with initial help files not found. Who will get the files from site...|No connection.|Create the Help is impossible. Connect to the Internet and try again.|Connection established.|After a few seconds you will get the file from the archive...|Archive obtained, unpacking...|Directory TCIMGHELP in place.|Preparing to create help files...|Create htm commands...|Creating basic htm...|Help compiling...| Create Help complete.| from | specially for Total Commander Image|Help|Update completed|Menu update completed|Update menu|Programs|Templates rename|Templates filter|Set filter|Font|Font install|Change menu|Cancel|don't contains icons|Select file with icons|Select...|Select icon|View icons|All files|Open|Save as|Select icon file|Library|Find and delete empty directories|Preparing to search...|Total directories:|Deleted directories:|Processed directories:|Empty directories not found...|Find and delete empty directories completed:|in directory|Create a list|Creating a list...| Wait...|Processed |Turn on On top of all windows|Turn off On top of all windows|Panels information|Total Commander basic settings|Parameter|Value|Cancel|There is no Total Commander button in Clipboard|Copy button to Clipboard and repeat|Wait while panels information will be updated|Search templates|Search|Selection templates|Select|Copy templates|Copy|Move templates|Move|Copy with numbers|Exit the program|Object information using |Text information. Sheet № |Plugins|Information about plugins|Name|Description|Phrase|Found|repeated in the text|time|Safely Remove Hardware|Disable USB device |Scanning discs|Creates file list: |Process directories: |Creates extensions list: |Files will be copied after list creating.|List is created. Files are copied...|repeated in lines|Copy selected|Copy all text|Folder shortcuts information|Shortcut name~Start path~Start options~Working directory~Shortcut~Description~File icon~№~State|Information object by template |Found line|Information about built-in programs Total Commander|New toolbar|New toolbar was created|Built-in commands Total Commander|Custom commands Total Commander|Command|Options|Start path|Path and icon number|ASCII table|Symbol|Context menu items|List |Write list of file types to the Clipboard| File types |Extract all icons to library directory|Extract all icons to directory on your desktop|Extract all icons to directory on active panel TC|Extract all icons to selected directory|Extract selected icon to library directory|Extract selected icon to directory on your desktop|Extract selected icon to directory on active panel TC|Extract selected icon to selected directory|Extract|Select a directory to extract icons|Information high-level windows|Descriptor|Window class|Error|Parameters are outside limits|Library| not found...~You must specify path in TCIMG.ini in section [DLL]| is not downloading...~Try to specify another version.|online help|Open help in browser|check update|Open TCIMG page in browser|File | not found|you need to install plugin...|Fields:|Values:|Copy line|Parameter [tc=...] doesn't work when GetTextMode=0|You need to change key value in Wincmd.ini in [Configuration]|TCIMG stops work.|Icons selection dialogue for adding to library before active icons|Icons selection dialogue for adding to library after active icons|Icons selection dialogue for deleting from library|Select icons for adding to library|Select icons for deleting from library|Icons (*ICO)|Transfer selected items to array GLOBALARRAY @CRLFand closing current window@CRLFIf nothing is selected all items are transferred|Select color|Table Coding|№~Code~Reduction~Description~Description|Exit| processes |Descriptors|The utility suspended.~Not found API-key for Yandex translate.~You must register API-key in section [Setting] in key YandexKey.|To join you need | images |The specified window to which you want to attach the information line is not found|There is no Total Commander button in the specified file|Services|Processes|Up Home|Page up PgUp|Page down PgDn|Way down End|No image in clipboard.~Copy the image to the clipboard and try again.| of |Copy marked|Passing marked items to an array GLOBALARRAY @CRLFand closing the current window@CRLFIf nothing is marked, all items are transmitted|@CRLFEditing: F2, Space, Double click on item.|Choose all|Cancel all|Invert|Program selection|The array passed to the function is larger than two-dimensional. 2D|The array is not passed to the function|Mistake: |Close the program?|Array truncated | lines will be displayed| columns will be displayed|Copying data|Please wait|Yes|Not|Deletion|Do you really want to move the item(s) to the trash?|Up Home~Page up PgUp~Page down PgDn~Way down End~Select all CTRL+A~Invert selection CTRL+S~Remove selection CTRL+Q|Up Home~Page up PgUp~Page down PgDn~Way down End~Tick ​​all items CTRL+A~Invert checked items CTRL+S~Uncheck all items CTRL+Q|Do not select the first item|Highlight the first item|Do not mark the first item|Mark the first item|Information of all graphics modes|Pause|Interrupt|Continue|Abort scan and copy found|Folder selection|Information from the window "Group rename"|Transfer list to array GLOBALMULTI~and closing the current window.|Description:|Error number:|Line number:|A source:|The function does not exist or the number of parameters is incorrect.|System Codec Information|Path Active panel~L-selected Kb~LTotal Kb~L-selected files~L-total files~L-selected folders~L-total folders~L-Path Left panel~L-filter~R-selected Kb~R-Total Kb~R-selected files~R-total files~R-selected folders~R-total folders~R-Path Right panel~R-filter~X-ftp if there is|№~Parameter~Value |    Name                x32  x64  Version    Path                          Description@CRLF|№~Name~x32~x64~Version~Path~Description|№~Name~DEC~HEX~Description~ICON~HOTKEY|№~Name~Description~Team~Options~Launch path~The path and number of the icon~W~HOTKEY|№~Symbol~DEC~HEX~OCT|№~Descriptor~Window class|Menu of all files in the folder containing icons|Creating a file menu ... |Copy to clipboard menu|Write number icon to buffer~Write file name to buffer~Записать в буфер имя файла без расширения~Записать в буфер родительский путь~~Записать в буфер путь и номер значка~Записать в буфер путь файла~~Записать в буфер %путь% и номер значка~Записать в буфер %путь% файла~~Записать в буфер пу\\ть и номер значка~Записать в буфер пу\\ть файла|Libraries menu icons|Edit menu ...|Add...~Edit ...~Delete~Up~Down~Copy|Add item|Enter the data item|Change item|Modify data item|Disc labeled "*" does not exist!~The program will be closed.|Information about disk labels|The selected text:|Highlighted symbols: |Range: |• Renaming •|Message|Continue?|Yes<+>1<+>No<+>:EXIT:|~Allocated files~Total files~Highlighted folders~Total folders~Allocated objects~Total objects~Index 1-th object~Index 1-th file~The index of the cursor~Handle panels~Path~Filter~Status~Information panels~The status bar~Drive~The name of the active object~Active object~Wood Handle|Information window|The window handle~Window class~The title of the window~Window text~The name of the process~Command line~Workflow creation date~Process path~The PID of the process~Bit depth~Window style~The amount of styles~Style constants~Extended window style~The sum of the extended styles~Style constants~The X position of the upper-left corner of the~The Y position of the top left corner~The width of the window~Window height~The X position of the bottom-right corner of the~The Y position of the bottom-right corner of the~The X position of the upper left corner of the client area~The Y position of the upper left corner of the client area~The width of the client area of a window~The height of the client area of a window~The x position of the lower-right corner of the client area~The y position of the lower-right corner of the client area~Window frame width~The height of the header menu~The caption height without menus~Menu width~The height of the menu~The X position of the upper-left corner of the menu~The Y position of the upper-left corner of the menu~The X position of the bottom-right corner of the menu~The Y position of the bottom-right corner of the menu~A handle to the menu~Minimized window~Expanded window~Window is active~On top of all Windows~Handle to the parent window~Handles and window element classes~The PID of the process from which to run Windows~The path of the program from which you are running the window|№~Description~Value|№~Handle~Class~NN~ID~WX~WY~DX~DY~W~H~Text~Style~ExStyle|Nutritional status~Battery charge status~The percentage of full charge~The number of seconds ~The number of seconds a full charge ~Battery name~The name of the manufacturer~Date of manufacture~Serial number~The identification string~Current temperature~Uptime in seconds~Possible battery~Battery technology~Chemical composition~Theoretical capacity~Current capacity~Power warning 1~Power warning 2~Reporting power~Number of charge cycles|Charger Info|Change language|You just want to change the language?|Support the project|Open project support page|Selecting objects|Tip to the Team~Close when repeatedly press|
Translite2=Russian|Ukrainian|Belarusian|Georgian|Azerbaijani|Uzbek|Kazakh|Tatar|Kyrgyz|Dutch|English|French|German|Italian|Norwegian|Portuguese|Spanish|Swedish
Translite3=Press the button and select window|Text is copied when you click on window| When you click on ALT - window class, CTRL - coordinates, SHIFT - styles|Exit|Instance|Class|ID|Rectangle|Text|Styles|Advanced|Upper left window corner position: |Upper top window corner position: |Window width: |Window height: |Width of client area: |Height of client area: |-not found|About
Translite4=Red|Green|Blue|Hue|Saturation|Brightness|Output format color|Copy color to Clipboard|Download color from Clipboard|Select a color|Exit|Named color|Color value|Hold down left mouse button, select the color|Disable additional color panels|Include additional color panels|View highlighted color in AkelPad|Insert color into AkelPad|Turn OFF top of all windows|Turn ON over all windows|Roll up|Invert|Shades|Enable palette panel|Disable palette panel|Enable color bar|Disable color bar|Magnifier size|Increase magnifier size|About|Generate random color|Add color to palette|Windows dragging area|Close all windows with similar color, but the active|Viewe colors in separate window (SPACE)|
Translite5=Play in random order|Play one by one|Repeat|Do not repeat|Previous track|Rewind back|Stop|Rewind forward|Next track|Volume|Rewind|Play from the beginning|View playlist window|Exit|Play|Open playlist window|Playlist|Close playlist|Pause|NO MORE TRACKS IN PLAYLIST              |Roll up|Detach from header|Creating list...|Turn OFF top of all windows|Turn ON top of all windows|Attach ar TC header|About|Copy to Clipboard current track path|Copy to Clipboard current track name|Copy to Clipboard current track information|Create playlist|Remove track from playlist|Physical remove current track from drive|Select filename for playlist|Playlist|All|Delete file|File:|will be deleted.|Are you sure you want to delete it?|Deleted|There are no adress for play in Clipboard|Playlists||Copy to Clipboard the name and address of radio station|Set radio station from Clipboard:|• Name and address are divided |• Only address|Button for direct radio stations|line break|symbol |Button for radio stations from HTML-pages|List of playlists|Enter name~Enter radio station name.|Add to favorites|Collapse in tray|Random radio station|
Translite6=• Mark the area on desktop, hold down left mouse button|• Hold down CTRL or right mouse button to select the window/element|• Scrolling the mouse wheel: increase/decrease zoom|• Exit ESC|• Position: |• SHIFT or middle mouse button will create a screenshot|• Left mouse button - activation of windows/menus|• Right mouse button - activation of context menu|• Size:   |• Hold down left mouse button to move area|• Hold down left mouse button at edges of the area for resizing|• Left-click outside the field of window activation|• ALT - screenshot of the entire screen|• SHIFT, left or middle mouse button will create a screenshot|• SHIFT, right or middle mouse button will create a screenshot|• Arrows ← ↑ → ↓ and buttons A W D S move the area|• Buttons R G, T F, Y J, U H move the area angles|•  |• Create screenshot by points~• Right mouse button for new point~• Left mouse button for moving points~• SHIFT or middle mouse button for creating screenshot~|• Creating # point will automatically create a screenshot~|• Creating circle screenshot~• 1. Create the center point of circle~• 2. Create a point on the circle~• Points are created by Right mouse button~|• Creating ellipse screenshot~• 1. Create the center point of the ellipse~• 2. Create a point of limiting the height of the ellipse~• 3. Create a point of limiting the width of the ellipse~• Points are created by Right mouse button~|
Translite7=An error has occurred|File is too large|File doesn't exist|Format is not supported|File <%s> uploaded on [%s]|Upload image|Uploading|Uploading progress|Uploading is complete|[Internal loading error]|Unable to load file|Copy link to Clipboard|Close|Disable always on top|Enable always on top|Minimize|Link to delete images from hosting:|Copy all links formats to Clipboard|Open this link in browser|List of all uploaded images|Images and Links|
Translite8=View Random|View one by one|Repeat|Do not repeat|Previous image	Left|Next image		Right|First image in list|Last image in list|Random image|Full screen mode|Windowed mode|Minimize|Exit	ESC|More actions menu|About the program|Disable always on top|Enable always on top|Clipboard|Copy current image path|Copy current image name|Go...|To current file in Total Commander right|To current file in Total Commander left|Rotate image|Rotate 90° left	Up|Rotate 90° right	Down|Mirror rotate horizontally|Mirror rotate vertically|Save changes and exit|Stay unsaved images.|Begin slide show|End slide show
Translite9=About the program|Exit|Restart|Tracking buffer|Empty string|Additionally|
Translite10=Directories|System|List| View | Information  |Next font Right|Previous font Left|Text color|Background color|Bold On/Off  Ctrl+B|Italic On/Off  Ctrl+I|Underline On/Off  Ctrl+U|Smooth On/Off  Ctrl+T|View in separate window On/Off Alt+SPACE|Name:|Type:|File:|Date:|Size:|Refresh list|Copy file to...|Install font |Delete font |Temporary (to logoff)|Install|Install font|Font | already installed. Uninstall and reinstall.| already exists.|Unable to write to Registry.|Unable to copy | was installed, but it requires a system restart.|Unable to install a font |Temporary (to logoff)|Constantly|Copy font to directory Fonts|Select directory with fonts|Deleting font|Are you sure, you want to delete a font | not deleted completely.|was deleted, but it requires a system restart.| can not be deleted.|Select directory for font.|Copy font| already exists.|Do you want to replace it?|Error|Can not copy file(s).|About the program|Delete directory from list|Save to selected directory|Saved to specified directory|Screenshot format |Select directory for screenshots|Change default directory|Help|Information about the font|
Translite11=January|February|March|April|May|June|July|August|September|October|November|December|January|February|March|April|May|June|July|August|September|October|November|December|January|February|March|April|May|June|July|August|September|October|November|December|January|February|March|April|May|June|July|August|September|October|November|December|January|February|March|April|May|June|July|August|September|October|November|December
Translite12=Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday
Translite13=year|year|year|year|years|years
Translite15=Timer|Stopwatch|Alarm clock|Hello|Enter message.@CRLFBreak long text into phrases.~Each phrase - from a new line.|Hours|Minutes|Seconds|Show message|Turn on sound|Repeat|Auto-restart|Start|Stop|5 sec~10 sec~20 sec~30 sec~45 sec~1 min~2 min~3 min~5 min|Help|About the program|Remaining: |Continue|Pause|Add message|Delete message|Play audio file|Add audio file|Remove audio file|Automatically start timer again at the end of timer@CRLFProcess can be disabled only by pressing Stop|Minimize to tray|Select sound file|Reset|Round|Copy to Clipboard|Save to file|Metronome|Mon|Tue|Wed|Thu|Fri|Sat|Sun|Add to list|Turn off|Turn on|Delete|All days|Click right mouse button to select the repeat mode|
Translite16=Shortcut:|Object:|Parameters:|Working directory:|Shortcut:|Description:|Icon file:|Icon number:|Window:|Custom size|Full screen|Minimized window|Save|Save as|Close|Select shortcut file for editing|There is unsaved data. Do you want to save?|Select object for shortcut|Select working directory|Information |Disable always on top|Enable always on top|Select shortcut file|Select object|Paste parameres from Clipboard|Select working directory|x|Insert description from Clipboard|Select icon file|x|List all shortcuts in current directory|Previous shortcut|Next shortcut|Select shortcut file for saving|No| * Shortcuts is changed * |
Translite17=Difference in seconds:|Difference in minutes:|Difference in hours:|Difference in days:|Difference in weeks:|Difference in months:|Difference in years:|Insert date from Clipboard left|Insert system date left|Insert date from Clipboard right|Insert system date right|Insert dates from Clipboard left and right@CRLFSeparators between dates in key Delimeters|Calculate|Temporary difference is:|Wright to Clipboard|Same dates| hours, | minutes, | seconds|Difference of dates [year/month/day h:m:s]|Disable always on top|Enable always on top|Insert system date left and right|Select file|Select directory| [modification date]| [creation date]| [last access date]|Insert left date of Selected object|Insert right date of Selected object|Change date left|Change date right|Change date|Wright date to Clipboard left|Wright date to Clipboard right|Insert date from Clipboard|Insert data from Clipboard|Wright date to Clipboard|Change|Cansel|Seconds~Minutes~Hours~Days~Weeks~Months~Years
Translite18=Insert character set from Clipboard|Add current character set to the list|Delete current character set from the list|Current character set is already present in the list|Number of characters in password:|Start|Number of passwords:|Generate:|To Clipboard|To file|Generate passwords to Clipboard|Select file for generated passwords|Write passwords to Clipboard|Save password file|Generate password file |Passwords are stored to file:|Do you want to open it?|Disable always on top|Enable always on top|Prefix:|Suffix:|
Translite19=Move item up~Delete selected items~Move item down~Paste item~Insert selected items~Insert all items~Copy selected items to Clipboard CTRL +C|Turn off template library|Turn on template library|Turn off Clipboard tracking|Turn on Clipboard tracking |&Log|&Clean log|&Change maximum number of items|&Editor|Wrap On/Off |Help |About program|Changing number~Enter number: maximum number of records in journal. |Add to Library~Enter template name.@CRLFTemplate will be saved to current@CRLFlibrary: |Template name|Error|No data to save in your journal...|You have not selected any item...|No saved templates in your library...|Add to Library~Enter new library file name: |File name|You have no library file...|Create new library file|Delete library file from directory|Save changes to the current template|Add new template to the current library file|Remove the template from the current library file|Update library templates|Disable always on top|Enable always on top|Disable tracking when working with library|Cancel|Repeat|Cut|Copy|Insert|Close workspace|Open workspace|Send new to editor On/Off |Window transparencywhen inactive|&Case sensitive phrase|&Clear clipboard when tracking on/off|
Translite20=0| FTP setting |Netlist:|Connection name:|Server [:Port]:|Account:|Password:|Remove current connection from the list|Enter Connection name to save settings~This name will be used in FTP-commands...~It's desirable, that it is no spaces|Enter IP-address for FTP-server~Port number can be set through the colon|Enter user name (login)|Enter password|Passive transfer mode|Toggle connection to passive mode~For FTP-servers, that do not support active connection mode|Use password for database|If you use a password for entire database~it will be necessary each time to confirm it|Enter master password for entire database~and save by pressing button "S"|Save master password for entire database~Password is encrypted and stored|Check connection|Save|Cancel|All information is encrypted~and written to section [FTP]|Error|No one value ​​entered|Such Connection name already exists.~Do you want to change data?|Warning|   Check connection...|   Successful connection...|   Connections not installed...|Enter master password |trying|You should protection of database by master@CRLFpassword. To change the database@CRLFit necessary to confirm master password.|You want to delete master password|@CRLF   You should protection of the database by master password.@CRLF   For use in FTP-commands it necessary@CRLF   after the key through the separator ~ set master password.|@CRLF   You should protection of database by master password.@CRLF   This password does not match with master password.|@CRLF   In key | there are incorrect data...|From:|To:| Download from FTP | Upload to FTP |------------------ Create FTP list ------------------@CRLFDirectory : *1*@CRLFObject : *2*@CRLFNumber : *3*|
Translite22=Move the string/rows up~Move the string/rows down~Transfer according to words On.\Off.~Save@CRLFCTRL+S~Cancel~Remove selected or clean everything~Copy all text~Copy dedicated~Copy string~Exit from the program~Transfer rows to an array GLOBALTEXTV and closing the current window@CRLFCTRL + ENTER~Open file in another program@CRLFCTRL+E~The file was changed by another program@CRLFStart file?~Search    CTRL+F@CRLFReplacement CTRL+H|Turn off over all windows|Turn on top of all windows|Open file in ||||||||||||||||||||||||||||||||||||SEARCH|REPLACEMENT|||||Find|Replace|||||What:|How:|Find down|Find top|In highlight|Find further|Replace|Replace all|Account the register|The word is entirely|Regular expressions|Down|Up|Go to the beginning of the document|Go to the end of the document|Search completed|Number of replacements: |Found: |, Line: |Line: |Column: |Allocated: |Sum characters: |Sum lines: |Position carriage: |Start of allocation: |End of selection: |Highlighted string: |First row of selection: |The last row of selection: |Row transfer: |

Translite23=Write to Clipboard|Exit|Pause/Start|Zero
Translite24=Lines color : format ARGB|Background color: format ARGB|Color selection|Color for first Alpha Channel from the clipboard|Color for second Alpha Channel from the clipboard|Style defining pattern, from 1 to 52|Factor stretch|Copy ARGB color to the Clipboard|
Translite25=15 seconds~30 seconds~45 seconds~1 minute~5 minutes~10 minutes~15 minutes~20 minutes~30 minutes~45 minutes~1 hour~2 hours~3 hours|Switching over |Set time|Change wallpapers|Settings|About|Exit|Pause|Run|Delete|Next|Previous|Are you sure you want to delete this file?|Command completion|The list has run out of images|Copy path|

; Translite32 - перевод в диалоге "О программе"
Translite32=Некоторые приложения|Просмотр и выбор цвета|Небольшой аудио плеер|Интернет радио|Просмотр шрифтов|Просмотр символов|Просмотр текстовой информации|Таймер. Секундомер. Будильник|Календарь|Сравнение дат|Генератор паролей|Тестирование регулярных выражений|Информационная строка|Просмотр буфера обмена|Создание различных диалогов|Захват информации с элементов окна|Видеоплеер|Плавающая панель инструментов|Создание различных меню с командами|Меню с различной информацией|Просмотр значков в файле|Редактирование ярлыков|Диалог изменения времени объектов|Чтение вслух текстовой информации|Генератор слов

Translite35=Resources|Information|Expand All Types|Collapse Types|Error|Inernal error|Error enumerating|Unable to load |Unexpected error occurred.|Need to close...|Play|Pause|Stop|Extraction Values| - name: | - ordinal: |One icon is compressed. You are not able to view it|Viewing compressed image|General information|Exported Functions|Exported functions - none|Imported functions |Sections| icons are compressed. You are not able to view them|Imported functions - none|

; InputBox1,InputBox2 ... InputBoxN - template in format TITLE|INFO|LINE(|Width|Height|TextSize|Mode) for use in parameter [input=BOX1] (for dialogs), where TITLE - window title, INFO - information in window, LINE - initial line in the input window, Width - windows width, Height - windows height, SIZE - font size, BOX1..BOXN - template name, Mode - any value displays "asterisk " (•) instead of characters when text entering
; Also can be used keys with any ending after basics InputBox, which has latin characters and an underscore _
InputBox1=Entering extension|Extensions for selected files.|txt|270|140
InputBox2=Entering number|Number of files to be copied to a separate directories.|2|270|150
InputBox3=Entering number|Number of files to be moved to a separate directories.|2|270|150
InputBox4=Entering number|The required number of directories.|2|290|120
InputBox5=Entering number|The required number of directories with current date.|2|270|150
InputBox6=Entering name|Name for new directory.|Name|270|130
InputBox7=Entering line|The string name with separator to create multiple directories.|1;2;3|270|150
InputBox8=Entering separator|Separator.|;|270|120
InputBox9=Entering name|Name and extension for new file.|Name.txt|270|140
InputBox10=Entering extension|Extensions for new file.|txt|270|140
InputBox11=Entering number|Number of files that will be created.|2|270|140
InputBox12=Entering name|Extension to copying the appropriate file from templates (enter the name if necessary).|Template.txt|282|168
InputBox13=Entering extension|Extensions for each name from Clipboard to create empty files.|txt|282|168
InputBox14=Entering extension|Extensions for each name from file under cursor to create empty files.|txt|282|168
InputBox15=Entering extension|Extensions for each name from selected objects to create empty files.|txt|282|168
InputBox16=Entering number|Number of files and directories for direct selection in the active panel.|10|270|150
InputBox17=Entering number|Number of files and directories for backward selection in the active panel.|10|270|150
InputBox18=Entering number|Number of files and directories for selection from cursor down in active panel.|10|270|150
InputBox19=Entering number|Number of files and directories for selection from cursor up in active panel.|10|270|150
InputBox20=Select files by number of characters|Condition for search in parameters.@CRLF1: 0 - less 1 - more, 2 - equal to length@CRLF2: p - path, n - name, i - name+ext., e - ext.@CRLF3: length@CRLF(parameters separated by a space)|1 n 5|310|180
InputBox21=Select directories by number of characters|Condition for search in parameters.@CRLF1: 0 - less 1 - more, 2 - equal to length@CRLF2: p - path, n - name, d - parent directory.@CRLF3: length@CRLF(parameters separated by a space)|1 n 5|310|180
InputBox22=Select objects by number of characters|Condition for search in parameters.@CRLF1: 0 - less 1 - more, 2 - equal to length@CRLF2: p - path, n - name, i - name+ext., e - ext.@CRLF3: length@CRLF(parameters separated by a space)|1 n 5|310|180
InputBox23=Entering number|Number of directories for direct selection in active panel.|10|270|140
InputBox24=Entering number|Number of directories for backward selection in active panel.|10|270|140
InputBox25=Entering number|Number of directories for selection from cursor down in active panel.|10|270|150
InputBox26=Entering number|Number of directories for selection from cursor up in active panel.|10|270|150
InputBox27=Entering number|Number of files for direct selection in active panel.|10|270|150
InputBox28=Entering number|Number of files for backward selection in active panel.|10|290|140
InputBox29=Entering number|Number of files to selection from cursor down in active panel.|10|270|150
InputBox30=Entering number|Number of files to selection from cursor up in active panel.|10|270|150
InputBox31=Entering numbers|Width of the image to resize selected images with preserving a relatively larger proportion.|800|300|168
InputBox32=Entering number|Icon's number in library to assign for selected directories.|0|270|150
InputBox33=Entering directory name|Name of the directory that is created to move or copy selected objects to it.|Directory|282|150 
InputBox34=Entering date|Date creation, modification or last access in format YYYYMMDDHHNNSS, separators do not matter.|2008.08.28 12:48:58|300|182
InputBox35=Entering directory name|Name of the directory that will be created at above level to move or copy selected objects to it.|Directory|300|150
InputBox36=Entering search string|Search in text files.|search for|282|140
InputBox37=Entering replacement string|Replace in text files.|replace by|282|140
InputBox38=Entering filter number|Filter's number to add extensions of selected files in association.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox39=Entering filter number|Filter's number to add clean names of selected files in association.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox40=Entering filter number|Filter's number to add names of selected files in association.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox41=Entering filter number|Filter's number to add@CRLFextensions of selected files@CRLFto Ignored assotiations.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox42=Entering filter number|Filter's number to add@CRLFclean names of selected files@CRLFto Ignored assotiations.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox43=Entering filter number|Filter's number to add@CRLFnames of selected files@CRLFto Ignored assotiations.@CRLF1 - Text, 2 - Archives, 3 - Graphics,@CRLF4 - Language, 5 - Scripts, 6 - Video,@CRLF7 - INI, 8 - Audio, 9 - Empty|1|300|200
InputBox44=Entering minutes|Time in minutes after which Winamp will stop.|5|270|140
InputBox45=Entering minutes|Time in minutes after which Winamp will continue.|5|294|140
InputBox46=Entering minutes|Time in minutes after which Winamp will close.|5|270|140
InputBox47=Entering icon|Enter the path and name of the icon to assign it to parent directory.|Name.ico|270|140
InputBox48=Entering extension|Extensions for files@CRLFmirrored files will be created in the current directory.|mp3|300|154
InputBox49=Entering extension|Extensions for mirrored files|txt|270|140
InputBox50=Group processing...|Number of modes to work with comments:@CRLF0 - Add/Replace if there.@CRLF1 - Add phrase at beginning.@CRLF2 - Add phrase at the end.@CRLF3 - Remove all.@CRLF4 - Delete phrase from beginning.@CRLF5 - Delete phrase from the end.@CRLF6 - Delete phrase in all.@CRLF7 - Replace phrase with phrase.|1|260|266
InputBox51=Entering comment|Phrase to add/remove/replace comments@CRLFTo replace "phrases in phrase" separate with using two exclamation marks!!|phrase|340|170
InputBox52=Entering password|Password for creation and encryption of archives.|12345|270|140
InputBox53=Entering mask|Mask of files to delete them in selected directories and subdirectories. Examples:@CRLFabout.jpg                      - remove file@CRLFabout.jpg&&new.png      - remove files@CRLF*.jpg&&*.bmp                  - remove by extensions@CRLF@CRLFOther examples of regular expressions you can see in Help||350|186
InputBox54=Entering mask|Mask for renaming base name of files in folders and subfolders.@CRLFWhat to look for and Than replace separated by !!@CRLFExamples:@CRLFcover(About)!!$1      - remove cover from name@CRLF.*(.{3})$!!$1            - leave 3 characters from the end@CRLF[\[\(\)\]]!!                  - remove all brackets@CRLFOther examples of regular expressions you can see in Help|What to look for!!Than replace|370|235
InputBox55=Entering disk|Drive letter.|C|270|125
InputBox56=Entering width|Image width.|300|270|125
InputBox57=Entering height|Image height.|300|270|125
InputBox58=Entering extension|Extension.|txt|270|125
InputBox59=Entering name|Name with extension.|About.jpg|270|125
InputBox60=Entering extension|Extension to be excluded from total selection.|txt|270|140
InputBox61=Entering extension|Extensions for selection.|txt|280|125
InputBox62=Entering line|Files names with delimited to create multiple files.|1;2;3|270|140
InputBox63=Entering password|Password to encrypt.||270|120|10|1
InputBox64=Entering password|Password to decrypt.||270|120|10|1
InputBox65=Entering number|Step counter.|1|270|120
InputBox66=Entering number|Counter begining.|1|270|120
InputBox67=Creating ISO image|ISO-file name|Name|270|125
InputBox68=Entering number of minutes|Time in minutes through which message will be shown.|5|270|140
InputBox69=Entering label|Disk label.|Label|230|120
InputBox70=Creating toolbar|Name of the new toolbar.@CRLF    Next:@CRLF1. File will be created Name.bar@CRLF2. Button will be created on panel@CRLF3. New panel will be opened for editing|Name|350|183
InputBox71=Entering tip|Tip to button|New toolbar|250|118
InputBox72=Creating anagram|World for anagram creating.@CRLFIt is recommended that the word is not longer 9 digits,@CRLFbecause it may take a long time |hello|330|153
InputBox73=Searching words|Letters, combinations of which@CRLF will be found in the dictionary.|hello|280|138
InputBox74=Inputing number|Minimum number of characters@CRLFin the words that will be included in the list.|3|320|138
InputBox75=Inputing number|Maximum number of characters@CRLFin the words that will be included in the list.|23|320|138
InputBox76=Inputing password lenght|Number of characters to create a password.|14|270|138
InputBox77=Inputing icon number|Number of characters to extract it from the library.|1|270|138
InputBox78=Inputing size|Size for the gradient|10x100|270|140
InputBox79=Inputing color|Color for square|red|270|140
InputBox80=Edit the name|Changing the base name|$var_sname|1000|100
InputBox81=Inputing phrase or symbol|Phrase or symbol for searching in base object's name||270|140
InputBox82=Inputing phrase or symbol|Phrase or symbol for replacing in base object's name||270|140
InputBox83=Inputing Name|Name for the archive.|Name|270|120
InputBox84=Inputing number|Required number|1|270|120
InputBox85=Inputing number|Pause in milliseconds|100|270|120

InputBox_VV=
InputBox_V19=Entering number|Enter number of links|0|270|140
InputBox_V20=Inputing link|Enter link|0|270|140
InputBox_V21=Inputing prefix|First part prefix|0|270|140
InputBox_V22=Inputing prefix|Ending prefix|0|270|140 
InputBox_V30=Inputing colour|Colour for new gradient|red-blue|270|140
InputBox_V31=Inputing colour|Colour for new gradient|red-blue|270|140

; RichInputBox1,RichInputBox2 ... RichInputBoxN - template in format TITLE|INFO|LINE(|Width|Height|TextSize|Mode) for using in parameter [input=BOX1] (dialog windows), where TITLE - window title, INFO - info in window, LINE - first line in input window, Width - window width, Height - window height, TextSize - font size, BOX1..BOXN - template name, Mode - any value displays "asterisk " (•) instead of characters when text entering
; Also can be used keys with any ending after basics RichInputBox, which has latin characters and an underscore _
RichInputBox1=Inputing password|Password for decryption.||270|120|10|1
RichInputBox2=

RichInputBox_VV=
RichInputBox_X01=Inputing password|Password for decryption.||@W-12|@H/2|10|1

; FolderBox1,FolderBox2 ... FolderBoxN - template in format INFO|PATH for use in parameter [sfold=BOXN] (for directory selection dialog), where INFO - information in dialogue, PATH - tree root for choice in dialogue, BOX1..BOXN - template name
; Also can be used keys with any ending after basics FolderBox, which has latin characters and an underscore _
FolderBox1=Directory to generate a list|
FolderBox2=Directory to copy all files|
FolderBox3=Directory to create a file|
FolderBox4=Directory with images|

FolderBox_VV=Select directory to copy all files|

; FolderPoint - if when you move/copy using regular expressions target directory is a point \. , it is replaced by \key value
FolderPoint=_Dot

; OpenBox1,OpenBox2 ... OpenBoxN - template in format INFO!!IPATH!!FILTER!!NAME!!EXT!!N for using in parameter [sopen=BOXN] (for file selection dialog), where INFO - information in the dialogue, PATH - tree root for choice in dialogue, FILTER - file filter (text_1|filter_1|text_2|filter_2|text_N|filter_N), NAME - original name, EXT - initial extension, N - number of initial filter that displays, BOX1..BOXN - template name
; Also can be used keys with any ending after basics OpenBox, which has latin characters and an underscore _
OpenBox1=File name to send the contents to the Clipboard.!!C:\!!Text (*TXT)|*.txt|All (*.*)|*.*!!Clip!!txt!!2
OpenBox2=Select a playlist to play in TCIMG Player!!C:\!!Playlist (*M3U *M3U8)|*.m3u;*.m3u8|All (*.*)|*.*!!Playlist!!m3u!!1
OpenBox3=Select file with saved tabs!!%commander_path%\Files\Tab\!!Tab (*TAB)|*.tab|All (*.*)|*.*!!MyTab!!tab!!1
OpenBox4=Select buttonbar file!!%commander_path%\Bars\!!Bar (*Bar)|*.bar|All (*.*)|*.*!!Default!!bar!!1
OpenBox5=Select image to upload on hosting!!C:\!!All supported files (*BMP *GIF *PNG *JPG *JPEG *JPE *TIFF *TIF)|*.bmp;*.gif;*.png;*.jpg;*.jpeg;*.jpe;*.tiff;*.tif|Window BMP (*BMP)|*.bmp|CompuServe (*GIF)|*.gif|PNG-files (*PNG)|*.png|JPEG-files (*JPG *JPEG *JPE)|*.jpg;*.jpeg;*.jpe|TIFF-files (*TIFF *TIF)|*.tiff;*.tif|All (*.*)|*.*!!Image!!bmp!!1
OpenBox6=Select files.!!!!All (*.*)|*.*!!!!!!1!!4
OpenBox7=


OpenBox_VV=

; SaveBox1,SaveBox2 ... SaveBoxN - template in format INFO!!IPATH!!FILTER!!NAME!!EXT!!N for using in parameter [ssave=BOXN] (for file selection dialog), where INFO - information in the dialogue, PATH - tree root for choice in dialogue, FILTER - file filter (text_1|filter_1|text_2|filter_2|text_N|filter_N), NAME - original name, EXT - initial extension, N - number of initial filter that displays, BOX1..BOXN - template name
; Also can be used keys with any ending after basics SaveBox, which has latin characters and an underscore _
SaveBox1=File name to save.!!C:\!!Text (*TXT)|*.txt|All (*.*)|*.*!!File!!txt!!2
SaveBox2=File name to save selection.!!C:\!!Text (*TXT)|*.txt|All (*.*)|*.*!!New!!txt!!1
SaveBox3=File name to save sent to Clipboard paths.!!C:\!!Text (*TXT)|*.txt|List (*LST)|*.lst|All (*.*)|*.*!!New!!txt!!1
SaveBox4=File name to saving current playlist in Winamp.!!C:\!!Playlist (*M3U *M3U8)|*.m3u;*.m3u8|All (*.*)|*.*!!Playlist!!m3u!!1
SaveBox5=File name to the list of deleted empty directories.!!C:\!!Text (*TXT)|*.txt|All (*.*)|*.*!!List!!txt!!1
SaveBox6=File name to save the contents of the Clipboard!!C:\!!Text (*TXT)|*.txt|All (*.*)|*.*!!Clip!!txt!!1
SaveBox7=File name to save the tabs in the file.!!%commander_path%\Files\Tab\!!Tab (*TAB)|*.tab|All (*.*)|*.*!!MyTab!!tab!!1

SaveBox_VV=


; FolderZiro - when creating directories if there is an empty name, it is taken from the value of the key
FolderZiro=Directory

; FileNameZiro - when creating files if there is an empty name, it is taken from the value of the key
FileNameZiro=Name.txt

; FolderLang1...FolderLangN - using of personal directories in the parameter tip<> 
FolderLang1=WebPages!!Web Pages||Arhives!!Arhives||Musics!!Music||Sounds!!Sounds||Scripts!!Scripts||Programms!!Programs||Texts!!Text||Systems!!System||Images!!Graphics||Video!!Video||Playlists!!Playlists||Icons!!Icons||Helps!!Helps||Books!!Books||Torrents!!Torrents||ThemePlayers!!Player's Themes||Cursors!!Cursors||Models3D!!3D Models||ImageDisks!!Disk Images||TempFiles!!Templates||Fonts!!Fonts
FolderLang2=

; FolderExtZiro - default directory, if the file type is not registered in any key in the parameter tip<> 
FolderExtZiro=Different!!Miscs

; Messages for internal use
; ErrorBox1 - ErrorBoxN - display messages for possible errors. Title||Message text||timeout (in seconds) after which the dialog will be automatically closed (0 - manual closing)
ErrorBox1=Add/Remove Associations||The length of the filter exceeds 1024 characters in length, it can result in an incorrect display of associated formats.@CRLFCreate new filter and try again.||8
ErrorBox2=Add/Remove Associations||The specified filter is not configured, you can't add file types that ignored.@CRLFSet filter and try again.||8
ErrorBox3=Add/Remove Associations||Section [Associations] not found, Association possibly is off.@CRLFPlease correct and try again.||7
ErrorBox4=

; InfoBox1...InfoBoxN - display information in command infbx=InfoBox1
; Also can be used keys with any ending after basics InfoBox, which has latin characters and an underscore _
InfoBox1=Cleaning temporary files||Task completed.@CRLF1. Temporary files deleted.@CRLF2. Emptied Recycles on all drives.@CRLF3. Cache updated.||6||300||100||5||5||20
InfoBox2=Message||Task completed||2||200||40||5||5
InfoBox3=Create menu||Creating menu and TC Image files finished!@CRLFProgram will rebooted.||4||300||83||5||5
InfoBox4=Counting subdirectories||In first level selected directories@CRLFare GLOBALSLIST<0> subdirectories (s)||4||350||60||5||5
InfoBox5=Checksums||Checksums match||5||300||43||5||5
InfoBox6=Checksums||Checksums do not match||5||300||43||5||5
InfoBox7=Error||One of the objects is not a file||5||200||63||5||5
InfoBox8=Compiling||Compiling completed||3||200||63||5||5
InfoBox9=Output results||In active panel@CRLFlocated [Info=x4] objects||4||350||63||5||5
InfoBox10=Current date and time||█ █ █ █ █ █ █ █ █ █ █ █@CRLF█ [Info=s43] █@CRLF█ █ █ █ █ █ █ █ █ █ █ █||4||200||80||5||5
InfoBox11=Message||Not found string in file@CRLFon set condition||4||250||64||5||5
InfoBox12=


InfoBox_TCIMAGE=.                                 ★ Welcome to TC IMAGE ★||Greetings to all who touched pack TC IMAGE@CRLFYour advice, comments, suggestions, you can@CRLFpost on support and development site@CRLF                            ☀ http://tc-image.3dn.ru ☀||6||450||105||-1||-1||20
InfoBox_VV=

InfoBox_TEST1=Message||Test №1||2||250||64||5||5
InfoBox_TEST2=Message||Test №2||4||250||64||5||5
InfoBox_TEST3=Message||Test №3||4||250||64||5||5

;ComboBox1, ComboBox2 ... ComboBoxN - template in format TITLE||INFO||LIST||X||Y||Number||Edit for use in parameter [combo=BOX1] (for dialogs) where TITLE - window title, INFO - information in window, LIST - string list of phrases that appear in the ComboBox, with a separator|, X - window width, Y - window height, Number - number of phrases from the list LIST, output in first ComboBox, Edit - 1 - editable ComboBox, 0 - not editable, BOX1 .. BOXN - template name
; Also can be used keys with any ending after basics ComboBox, which has latin characters and an underscore _
ComboBox1=Create file||Create text file:||Name.txt|Name.ini|Name.vbs|Name.au3|Name.ahk|Name.js|Name.html|Name.xml|Name.bat|Name.cmd|Name.doc|Name.xls|Name.lst|Name.m3u||343||117||1||1
ComboBox2=Select name||Select or enter file's name:||Name|New|File|ReadMe|Index|List|Test|Icon|Unnamed||343||117||1||1
ComboBox3=Select extension ||Select or enter file's extension:||txt|ini|vbs|au3|ahk|js|html|xml|bat|cmd|doc|lst||343||117||1||1
ComboBox4=Select format||Select image format:||jpg|jpeg|jpe|gif|bmp|dib|tif|tiff|png|pcx|tga|pcd|ico|psd||343||117||1||0
ComboBox5=Select quality||Choose converting images quality.||5|10|15|20|25|30|35|40|45|50|55|60|65|70|75|80|85|90|95||270||132||15||1
ComboBox6=Select width||Select new width.||128|160|200|256|314|320|448|640|800|1024|1152|1280|1360|1366|1400|1600|1680|1920||270||117||7||1
ComboBox7=Select height||Select new height.||128|160|256|314|448|640|800|1024|1152|1280|1400|1680|1920||270||117||7||1
ComboBox8=Select encryption algorithm||Select encryption algorithm.||AES|AES128|AES192|AES256|DES|DESX|3DES|3DES112|RC2|RC4|RC5|SEAL||260||117||4||0
ComboBox9=Select decryption algorithm||Select decryption algorithm.||AES|AES128|AES192|AES256|DES|DESX|3DES|3DES112|RC2|RC4|RC5|SEAL||260||117||4||0
ComboBox10=Positioning||Select position on panel TOOLS. Negative value indicates position of the end of panel.||1|5|10|15|20|25|30|35|-1|-5|-10|-15|-20|-25|-30|-35||310||147||1||1
ComboBox11=Select name||Select or enter directorie's name:||Name|New|Folder|Music|Test|Icon|New|Music||343||117||1||1
ComboBox12=Select depth||Enter the depth to create directories:||1|2|3|4|5|6|7|8|9|10||343||117||1||1
ComboBox13=Select quantity||Enter the number of catalogs,@CRLF that will be created in each subdirectory:||1|2|3|4|5|6|7|8|9|10||343||132||1||1
ComboBox14=Select disk||Select the disk for label||C|D|E|F|G|H|I|J|K|L|M|N|O|P|Q|R|S|T|U|V|W|X|Y|Z||230||132||1||1
ComboBox15=Select number||Enter number length (missing@CRLFbits will be filled with zeros)||2|3|4|5|6|7|8|9||258||133||1||1
ComboBox16=Select size||Select width and height of the square image.||16|24|32|48|64|96|128|160|200|256|314|320|448|640|800|1024|1152|1280|1360|1366|1400|1600|1680|1920||240||133||1||1
ComboBox17=Select number||Enter number of lines on how to split the file:||1|2|3|4|5|6|7|8|9|10||353||117||1||1
ComboBox18=Select archive||Enter archive extension:||zip|rar|7z|7zip||263||117||1||1
ComboBox19=Select template||Select template name for file creation||Html|Books|New||263||117||1||1

ComboBox_XX=Selection||Select||$var_item|Point1|Point2|Point3||241||134||1||2
ComboBox_X01=Create file||Create text file:||Name.txt|Name.ini|Name.vbs|Name.au3|Name.ahk|Name.js|Name.html|Name.xml|Name.bat|Name.cmd|Name.doc|Name.xls|Name.lst|Name.m3u||@W-16||117||1||1

ComboBox_V01=Choose mixing||Choose mixing mode:||Plus|Screen|Lighten|Luminize|CopyOpacity|Divide||280||115
ComboBox_V02=Enter color||Enter hue color - eg red or #FF1E0A or rgb:||SkyBlue|NavyBlue|fuchsia|gold|yellow|DarkOrange1|OrangeRed|green|LawnGreen|red|maroon|FloralWhite|grey70|black|none||280||135
ComboBox_V03=Enter size||Enter size of GIF, if 120x120  and in the end!, then without saving proportion:||30%%|15%%|50%%|75%%|80%%|120x120!|240x240!|64x64!|120x|240x|64x||280||135
ComboBox_V04=Enter size||Enter font size:||70|60|50|80|90|100|120||280||115
ComboBox_V05=Choose position||Choose position for font:||South|Center|North|NorthWest|NorthEast|West|East|SouthWest|SouthEast||280||115
ComboBox_V06=Enter size||Enter image crop size, if 120x120  and in the end!, then without saving proportion:||0%%|30%%|15%%|50%%|75%%|80%%|120x120!|240x240!|64x64!|32x32!|120x|240x|64x||280||155
ComboBox_V07=Choose quality||Enter quality for image:||100|90|80|70|60|50|40||280||135||3
ComboBox_V14=Enter color||Enter color for frame - eg red or #FF1E0A or rgb:||rgb(16,31,74)|red|blue|green2|goldblue|NavyBlue|MediumBlue|RoyalBlue|yellow|DarkOrange1|OrangeRed|green|LawnGreen|maroon|FloralWhite|S  lateGrey|black|none||280||155
ComboBox_V19=Enter time||Enter time for GIF animation:||10|15|20|25|30|40|50|80|100||280||135
ComboBox_V20=Enter number of cycles||Enter number of cycles for GIF animation:||0|10|20|25|30|40|50|80|100||280||135
ComboBox_V27=Choose figure||Choose figure:||test|5star|4_star|star_img|yinyang|smileface|love|cobweb|month|hands|skullcrossbones|bomb|wheel|snowflake|earth|ino|lips|chili|women||280||135
ComboBox_V29=Choose font||Choose font for label:||bookmndi|Segoe|Calligraph|Geisha|Italy_B|Kareta_A|Turandot|TelegraphShodwn||280||115
ComboBox_V32=Choose extension||Choose extension for image:||png|jpg|gif|bmp|ico|pdf||280||115
ComboBox_V33=Choose value||Choose trim in pix width for image:||0|30|50|40|10|20||280||135
ComboBox_V34=Choose value||Choose trim in pix height for image:||30|40|50|0|10|20||280||135
ComboBox_V37=Choose position||Choose position for figure:||SouthEast|SouthWest|South|NorthWest|NorthEast|Center|North|West|East||280||115
ComboBox_V38=Enter color||Enter color for channel1||NavyBlue|blue|MediumBlue|RoyalBlue|yellow|DarkOrange1|OrangeRed|green|LawnGreen|red|maroon|FloralWhite|SlateGrey|black|none||280||115
ComboBox_V39=Enter color||Enter color channel2||darkcyan|blue|NavyBlue|MediumBlue|RoyalBlue|yellow|DarkOrange1|OrangeRed|green|LawnGreen|red|maroon|FloralWhite|SlateGrey|black|white|none||280||115
ComboBox_V43=Enter indent||Enter indent in pixels, right or left:||0|5|10|15|20|25|30|40|50||280||115
ComboBox_V44=Enter indent||Enter indent in pixels, top or bottom:||0|5|10|15|20|25|30|40|50||280||115
ComboBox_V48=Choose size||Choose size for scaling (big value - less size):||1|0.8|0.7|0.6|0.5|2|3|4|5||280||135
ComboBox_V49=Enter size||Enter size for zoom, as a percentage:||75|80|85|90|95|70|65|60|55||280||135
ComboBox_V55=Enter number of cycles||Enter number of cycles for GIF animation:||3|5|10|0|20|25|30|40|50|80|100||280||135
ComboBox_V56=Choose frames||Choose frames per second:||15|10|20|25|30|5||280||135

;GroupBox1, GroupBox2 ... GroupBoxN - template in format TITLE<#>INFO<#>GROUP<#>LINERADIOBUTTONS<#>X<#>Y, where TITLE - title of window, INFO - information in window, GROUP - header group, LINERADIOBUTTONS - string list of radio buttons, consisting of pairs: name radio buttons and command line parameter passed when choosing - delimiter <+>, X - window width, Y - window height
; Also can be used keys with any ending after basics GroupBox, which has latin characters and an underscore _
GroupBox1=Select encoding<#>Gibberish will be replaced in the contents of selected text files.<#>Select encoding <#>Dos<+>@@Dos<+>Vindovyh<+>@@Win<+>KOI8-R<+>@@KOI8-R!!1<#>280<#>200
GroupBox2=Select converting mode <#>Convert image.<#>Select mode<#>All extensions under cursor<+>%p*.%E<+>All selected<+>/filelist =% L<#>290<#>160
GroupBox3=Select rotation mode<#>Rotate image.<#>Select<#>Right 90°<+>rotate_r<+>Left 90°<+>rotate_l<+>180°<+>rotate_r~~/rotate_r<+>Horizontal<+>hflip<+>Vertical<+>vflip<#>240<#>220
GroupBox4=Select processing mode<#>Select mode with comments.<#><#>Add row (comment will be replaced)<+>0<+>Add row at the comment beginning<+>1<+>Add row in the comment end<+>2<+>Delete a comment<+>3<+>Delete phrase from the beginning of comment (if present)<+>4<+>Delete phrase from the end of comment (if present)<+>5<+>Remove phrases throughout comment<+>6<+>Replace the string with string<+>7<#>20<#>290
GroupBox5=Select mode<#>Select operating mode with buttons.<#><#>Add to buttonbar button from Clipboard<+>1<+>Replace button by button from Clipboard<+>2<+>Delete button from buttonbar<+>0<>342<#>175
GroupBox6=Select buttonbar<#>Select buttonbar or buttonbars in that will be made action over the buttons.<#><#>Active panel<+><+>All panel prescribed in ListBars1<+>||1<#>322<#>170
GroupBox7=Select processing mode<#>Select the operating mode with labels.<#>element changes<#>Path to the project start<+>0<+>Working directory<+>1<+>Startup options<+>2<+>The description, tooltip<+>3<+>Name the file with icons<+>4<+>Index icon in file<+>5<+>Window state at startup<+>6<+>All elements (search/replace in all elements)<+>-1<#>20<#>290
GroupBox8=Select panel<#>Select where you want to create a button to a new toolbar<#><#>On the main panel<+>0<+>On active panel<+>1<#>280<#>170
GroupBox9=Button style<#>Button style<#><#>Usual<+>0<+>As menu<+>1<#>280<#>155

GroupBox_VV=

GroupBox_V02=Compression method<#>Select lightning compression<#>Selectompression <#>without compression<+>@|<+>compression5%<+>@|-contrast-stretch**5%%<+>compression10%<+>@|-contrast-stretch**10%%<+>compression15%<+>@|-contrast-stretch**15%%<+>сжатие20%<+>@|-contrast-stretch**20%%<+>compression25%<+>@|-contrast-stretch**55%%<+>compression30%<+>@|-contrast-stretch**30%%<#>280<#>280
GroupBox_V07=Select inversing<#>Select inversing<#>Select image inversing<#>vertical<+>@|-flip<+>horizontal<+>@|-flop<#>280<#>160
GroupBox_V08=Select normalization<#>Select normalization<#>Select image normalization<#>disabled<+>@<+>normalization<+>@|-normalize<#>280<#>160
GroupBox_V09=Select duplication<#>Select duplication<#>Select image duplication<#>disabled<+>@<+>with duplication<+>@|-duplicate**1,-2-1<#>280<#>160
GroupBox_V12=Select autocontrast<#>Select contrast<#>Select image autocontrast<#>off<+>@<+>autocontrast<+>@-auto-level**<#>280<#>160
GroupBox_V13=Select normalization<#>Select normalization<#>Select image normalization<#>off<+>@<+>normalization<+>@|-normalize*<#>280<#>160

GroupBox_X01=Select encoding<#>Krakozyabry will be replaced in the contents of selected text files.<#>Select encoding<#>Dos<+>@@Dos<+>Windows<+>@@Win<+>KOI8-R<+>@@KOI8-R!!1<#>@W-14<#>@H/2

;EditsBox1,EditsBox2 ... EditsBoxN - template in format Title<#>Info<#>Edit<#>Width<#>Height<#>TextSize<#>TextWeight<#>TextName<#>Color for using in parameter [edits=BOX1] (dialog windows), where TITLE - title of window, INFO - information in window, GROUP - header group, LINERADIOBUTTONS - string list of radio buttons, consisting of pairs: name radio buttons and command line parameter passed when choosing - delimiter <+>, X - window width, Y - window height
; Also can be used keys with any ending after basics EditsBox, which has latin characters and an underscore _
EditsBox1=Input comment<#>Input the string to add, remove or replace comment(s).<#>input comment<+>100<+>!<+>used when replacing the string on line<+>100<+><#>340<#>305
EditsBox2=Find and Replace<#>Input your search and replace phrase in selected files contents.<#>input search string<+>100<+>!<+>input replacement<+>100<+><#>340<#>305
EditsBox3=Find and Replace<#>Input to search and replace in selected files contents.<#>input search string<+>100<+>!<+>input  string<+>100<+>||<+>input search string<+>100<+>!<+>input replacement string<+>100<+><#>340<#>505
EditsBox4=Search phrases in text file<#>Enter search phrase.<#>enter line<+>100<+><#>340<#>185
EditsBox5=Search and Replace<#>Enter phrase to search and replacein contents of selected labels.<#>search. if no replacement, then string removes from value<+>100<+>!!<+>replacement. if no search, then string replaces the value<+>100<+><#>360<#>305
EditsBox6=

EditsBox_NN=Search and Replace<#>Enter a phrase to search and replace in contents of selected files.<#>enter search line<+>100<+>!!<+>enter replace line<+>100<+><#>340<#>305
EditsTextBox_NN=Line №1 default@CRLFwhen you call the dialogue<#>Line №2
EditsBox_V01=Input text<#>Input text<#>input text<+>100<+><#>340<#>185<#>10<#>700<#>Arial<#>5C6FCA
EditsBox_X01=Input text<#>Input text<#>input text<+>@H/2.6<+><#>@W-12<#>@H/2<#>10<#>700<#>Arial<#>5C6FCA

; Shape1, Shape2 ... ShapeN - title name for combined dialogues. Number N is used in command shape=N
; Also can be used keys with any ending after basics Shape, which has latin characters and an underscore _
Shape1=Creating files
Shape2=Convert images
Shape3=Resize images
Shape4=Find and replace
Shape5=Processing
Shape6=File encryption
Shape7=File decryption
Shape8=Data encryption
Shape9=Data decryption
Shape10=Total Commander ButtonBar
Shape11=Creating directories
Shape12=Creating directory structure
Shape13=Batch edit shortcut properties
Shape14=Change the disk label
Shape15=Creating a new toolbar
Shape16=Building a list of words
Shape17=Creating a gradient
Shape18=Search and replace in object names

ShapeV06=Create frames
ShapeV07=Create frames
ShapeV08=Video processing
ShapeV13=Generator URL

; TrayIconHint1, TrayIconHint2 ... ,TrayIconHintN - tips for tray icons in command <TRAY=HINT1> 
; Also can be used keys with any ending after basics TrayIconHint, which has latin characters and an underscore _
TrayIconHint1=Tips description:@CRLF• First line@CRLF• Second line@CRLF• Third line
TrayIconHint2=

TrayIconHint_VV=

; Title1, Title2, ... TitleN - templates window titles, used in the command title
; Also can be used keys with any ending after basics Title, which has latin characters and an underscore _
Title1=A new toolbar has been created
Title2=

Title_VV=Hello

; Window1 - properties window title
Window1=Properties:
; Window2 - name of the item "format" in disk's context menu
Window2=Format...
; Window3 - window title Properties: Internet in command runcm=4||0 ... runcm=4||7
Window3=Properties: Internet
; Window4 - window title Run, in command runcm=4||0 ... runcm=4||7
Window4=Run
; Window3 - title for selection and uploading file to filehosting in browser
; Window3=Select file to upload


ComboBox_V22=Select time||Select start time for processing:||00:00:00|00:00:05|00:00:10|00:00:15|00:00:20|00:00:25|00:00:30||280||115
ComboBox_V50=Select frames||Select frames per second:||1|2|3|5|10|15|20||280||135
GroupBox_V05=Select frames<#>Select frames<#>Select number of frames<#>without number<+>@<+>100+-<+>@|-vframes**LABEL<#>280<#>160
ComboBox_V51=Select number||Select total number of frames per second:||50|100|200||280||135
ComboBox_V47=Select quality||Select quality for image:||1|2|3|4|5|6|7|8|9||280||135
